/*
1. Написать функцию, добавляющую в конец списка вещественных чисел
элемент, значение которого равно среднему арифметическому всех его
элементов.
2. Создать класс, представляющий матрицу. Реализовать в нем метод,
вычисляющий определитель матрицы. Для реализации используйте
контейнеры из STL.
3. Реализовать собственный класс итератора, с помощью которого можно будет
проитерироваться по диапазону целых чисел в цикле for-range-based
*/

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}
